-- 021 특정 철자를 N개 만큼 채우기 (LPAD, RPAD)
-- 이름과 월급을 출력하는데 월급 컬럼의 자릿수를 10자리로 하고, 
-- 월급을 출력하고 남은 나머지 자리에 별표(*)를 채워서 출력
SELECT ename, LPAD(sal, 10, '*') salary1, RPAD(sal, 10, '*') salary2
    FROM emp ;
    
-- 출력 예시 
--KING	    ******5000	5000******
--BLAKE	    ******2850	2850******
--CLARK	    ******2450	2450******
--JONES	    ******2975	2975******
--MARTIN	******1250	1250******
--ALLEN	    ******1600	1600******
--TURNER	******1500	1500******
--JAMES  	*******950	950*******
--WARD	    ******1250	1250******
--FORD	    ******3000	3000******
--SMITH  	*******800	800*******
--SCOTT   	******3000	3000******
--ADAMS	******1100	1100******
--MILLER  	******1300	1300******
    
-- LPAD의 뜻이 왼쪽(left)으로 채워넣다(PAD)여서 왼쪽으로 별표(*)를 채우고 있다.
-- LPAD나 RPAD로 SQL 시각화도 가능
SELECT ename, sal, LPAD('■', round(sal/100), '■') bar_chart
    FROM emp ;
    
-- 출력 예시
--KING	    5000	■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
--BLAKE	    2850	■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
--CLARK	    2450	■■■■■■■■■■■■■■■■■■■■■■■■■
--JONES	    2975	■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
--MARTIN	1250	■■■■■■■■■■■■■
--ALLEN   	1600	■■■■■■■■■■■■■■■■
--TURNER	1500	■■■■■■■■■■■■■■■
--JAMES	    950	■■■■■■■■■■
--WARD	    1250	■■■■■■■■■■■■■
--FORD	    3000	■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
--SMITH	    800	■■■■■■■■
--SCOTT	    3000	■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
--ADAMS	1100	■■■■■■■■■■■
--MILLER  	1300	■■■■■■■■■■■■■
    
    